Revit 2027 API
FabricArea.GetTotalSheetMass Method
 Calculates the total sheet mass: Volume of Wire * Unit Weight.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetTotalSheetMass()
Public Function GetTotalSheetMass As Double
public:
double GetTotalSheetMass()
member GetTotalSheetMass : unit -> float
Return Value
Double
 The total sheet mass.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace